public class Algorithms {
    public static void main(String[] args) {

    }

    // Написать метод который проверяеть является ли переданный параметр простым числом. Простое число это число, которое без остатка делится толлько на 1 и на само себя
    // Метод должен принимать целчисленный параметр в качестве аргумента.параметра, и возвращать тру или фолс
    public boolean isSimpleNumber(final int number) {
        return false;
    }

    // Написать метод, который будет сортировать массив строк по убыванию длинны строк. Регистр и язык строки неважен
    // Метод должен принимать на вход массив строк и возвращать отсортированный массив(Возмоно другой объект)
    public String[] sortArray(final String[] array) {
        return null;
    }

    // Написать метод, находящий факториал числа, переданного в качестве аргумента
    // calculateFactorial(5) // 120
    public int calculateFactorial(final int n) {
        return 0;
    }


    // Задачка со звездочкой
    // Написать примитивный калькулятор для 4 действий (+-/*) для римских циср от 1 до 10.
    // Метод принимает на вход 3 строковых параметра, последовательность всегда одна и таже первый операнд, втоорой операнд и операция
    // Метод должен возвращать строковое значение
    // example calculate("V", "VI", "+"); // Xi
    public String calculate(final String value1, final String value2, final String operation) {
        return null;
    }
}
